wld-code/AIoTEngineeringLabs/ch02-rtos-latency/freertos/sdkconfig.defaults
# Lab 2 freertos — defaults for the Seeed Studio XIAO ESP32-S3.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Single core + run-time stats so the idle-percentage metric is unambiguous.
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# NOTE: automatic light sleep (CONFIG_PM_ENABLE / tickless idle) is the
# "battery build" extension in Chapter 2's "Going further". It is left OFF by
# default because light sleep can drop the USB-Serial-JTAG monitor this lab
# reads its numbers from.
